Niveau 1 - Facile ðŸŸ¢
Exercice 1
RÃ©cupÃ¨re la premiÃ¨re ligne du DataFrame.
<details>
<summary>ðŸ’¡ Indice</summary>
Tu connais la position (premiÃ¨re = 0), pas le nom.
</details>


Exercice 2
RÃ©cupÃ¨re les informations de l'employÃ© E003.
<details>
<summary>ðŸ’¡ Indice</summary>
Tu connais le label/nom de l'index.
</details>


Exercice 3
RÃ©cupÃ¨re les 3 derniÃ¨res lignes.
<details>
<summary>ðŸ’¡ Indice</summary>
"3 derniÃ¨res" = positions, pas des noms.
</details>


Exercice 4
RÃ©cupÃ¨re uniquement la colonne salaire (toutes les lignes).
<details>
<summary>ðŸ’¡ Indice</summary>
Tu connais le nom de la colonne.
</details>


Exercice 5
RÃ©cupÃ¨re les 2 premiÃ¨res colonnes (toutes les lignes).
<details>
<summary>ðŸ’¡ Indice</summary>
"2 premiÃ¨res" = positions.
</details>


Niveau 2 - IntermÃ©diaire ðŸŸ¡
Exercice 6
RÃ©cupÃ¨re le salaire de l'employÃ© E004.
<details>
<summary>ðŸ’¡ Indice</summary>
Tu connais le label de la ligne ET le nom de la colonne.
</details>


Exercice 7
RÃ©cupÃ¨re la valeur Ã  la ligne 2, colonne 3 (positions).
<details>
<summary>ðŸ’¡ Indice</summary>
Tout est en positions â†’ iloc.
</details>


Exercice 8
RÃ©cupÃ¨re tous les employÃ©s du dÃ©partement IT.
<details>
<summary>ðŸ’¡ Indice</summary>
Tu as une condition (departement == 'IT').
</details>


Exercice 9
RÃ©cupÃ¨re le nom et le salaire des employÃ©s qui ont plus de 30 ans.
<details>
<summary>ðŸ’¡ Indice</summary>
Condition + sÃ©lection de colonnes par noms.
</details>


Exercice 10
RÃ©cupÃ¨re les lignes E002 Ã  E005 (inclus).
<details>
<summary>ðŸ’¡ Indice</summary>
Tu connais les labels. Rappel : loc inclut la borne finale !
</details>


Niveau 3 - AvancÃ© ðŸ”´
Exercice 11
RÃ©cupÃ¨re les lignes de position 1 Ã  4 (4 exclu) et les colonnes age et salaire.
<details>
<summary>ðŸ’¡ Indice</summary>
Positions pour les lignes, noms pour les colonnes... ðŸ¤”
</details>


Exercice 12
Augmente de 5000â‚¬ le salaire de tous les employÃ©s du dÃ©partement IT.
<details>
<summary>ðŸ’¡ Indice</summary>
Modification conditionnelle â†’ loc.
</details>


Exercice 13
RÃ©cupÃ¨re le nom de l'employÃ© qui a le salaire maximum.
<details>
<summary>ðŸ’¡ Indice</summary>
Utilise `idxmax()` pour trouver l'index du max.
</details>


Exercice 14
RÃ©cupÃ¨re les colonnes dans cet ordre : salaire, nom, departement (toutes les lignes).
<details>
<summary>ðŸ’¡ Indice</summary>
RÃ©organisation par noms de colonnes.
</details>


Exercice 15
CrÃ©e une nouvelle colonne niveau :

"Senior" si annees_exp >= 10
"Junior" sinon

<details>
<summary>ðŸ’¡ Indice</summary>
Modification conditionnelle avec loc (2 instructions).
</details>


Niveau 4 - Expert ðŸŸ£
Exercice 16
RÃ©cupÃ¨re les employÃ©s qui :

Ont plus de 30 ans ET
Gagnent plus de 50000â‚¬ ET
Sont dans le dÃ©partement IT ou Finance

<details>
<summary>ðŸ’¡ Indice</summary>
Conditions multiples avec `&` et `|`. N'oublie pas les parenthÃ¨ses !
</details>


Exercice 17
Pour chaque employÃ© du dÃ©partement RH, affiche son nom et augmente son salaire de 10%.
<details>
<summary>ðŸ’¡ Indice</summary>
Filtrage + modification en place.
</details>


Exercice 18
RÃ©cupÃ¨re une ligne sur deux, en partant de la deuxiÃ¨me, et seulement les colonnes de position paire.
<details>
<summary>ðŸ’¡ Indice</summary>
Slicing avec step â†’ iloc.
</details>

In [1]:
import pandas as pd

employes = pd.DataFrame({
    'nom': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank'],
    'departement': ['IT', 'RH', 'IT', 'Finance', 'RH', 'IT'],
    'age': [28, 35, 42, 31, 26, 38],
    'salaire': [45000, 52000, 67000, 58000, 41000, 61000],
    'annees_exp': [3, 8, 15, 6, 2, 12]
}, index=['E001', 'E002', 'E003', 'E004', 'E005', 'E006'])

print(employes)

          nom departement  age  salaire  annees_exp
E001    Alice          IT   28    45000           3
E002      Bob          RH   35    52000           8
E003  Charlie          IT   42    67000          15
E004    Diana     Finance   31    58000           6
E005      Eve          RH   26    41000           2
E006    Frank          IT   38    61000          12

In [3]:
# Exercice  1
employes.iloc[0]

nom            Alice
departement       IT
age               28
salaire        45000
annees_exp         3
Name: E001, dtype: object

In [4]:
# Exercice 2
employes.loc['E003']

nom            Charlie
departement         IT
age                 42
salaire          67000
annees_exp          15
Name: E003, dtype: object

In [5]:
# Exercice 3
employes.iloc[-3:]

        nom departement  age  salaire  annees_exp
E004  Diana     Finance   31    58000           6
E005    Eve          RH   26    41000           2
E006  Frank          IT   38    61000          12

In [6]:
# Exercice 4
employes.loc[:, 'salaire']

E001    45000
E002    52000
E003    67000
E004    58000
E005    41000
E006    61000
Name: salaire, dtype: int64

In [7]:
# Exercice 5
employes.iloc[:, :2]

          nom departement
E001    Alice          IT
E002      Bob          RH
E003  Charlie          IT
E004    Diana     Finance
E005      Eve          RH
E006    Frank          IT

In [8]:
# Exercice 6
employes.loc['E004','salaire']

np.int64(58000)

In [9]:
# Exercice 7
employes.iloc[2, 3]

np.int64(67000)

In [10]:
# Exercice 8
employes.loc[employes['departement'] == 'IT']

          nom departement  age  salaire  annees_exp
E001    Alice          IT   28    45000           3
E003  Charlie          IT   42    67000          15
E006    Frank          IT   38    61000          12

In [11]:
# Exercice 9
employes.loc[employes['age'] > 30, ['nom', 'salaire']]

          nom  salaire
E002      Bob    52000
E003  Charlie    67000
E004    Diana    58000
E006    Frank    61000

In [12]:
# Exercice 10
employes.loc['E002':'E005']

          nom departement  age  salaire  annees_exp
E002      Bob          RH   35    52000           8
E003  Charlie          IT   42    67000          15
E004    Diana     Finance   31    58000           6
E005      Eve          RH   26    41000           2

In [13]:
# Exercice 11
# MÃ©thode 1 : Utiliser loc aprÃ¨s avoir sÃ©lectionnÃ© les lignes
employes.iloc[1:4].loc[:, ['age', 'salaire']]

      age  salaire
E002   35    52000
E003   42    67000
E004   31    58000

In [14]:
# Methode 2 : Utiliser iloc pour tout(position des colonnes)
employes.iloc[1:4,[2,3]]

      age  salaire
E002   35    52000
E003   42    67000
E004   31    58000

In [16]:
# Exercice 12 Augmenter salaire IT
employes.loc[employes['departement'] == 'IT', 'salaire'] += 5000
employes

          nom departement  age  salaire  annees_exp
E001    Alice          IT   28    55000           3
E002      Bob          RH   35    52000           8
E003  Charlie          IT   42    77000          15
E004    Diana     Finance   31    58000           6
E005      Eve          RH   26    41000           2
E006    Frank          IT   38    71000          12

In [19]:
# Exercice 13- Nom du salaire max
employes.loc[employes['salaire'].idxmax(), 'nom']

'Charlie'

In [20]:
# Exercice 14 - ReorganisÃ© les colonnes
employes.loc[:, ['salaire', 'nom', 'departement']]

      salaire      nom departement
E001    55000    Alice          IT
E002    52000      Bob          RH
E003    77000  Charlie          IT
E004    58000    Diana     Finance
E005    41000      Eve          RH
E006    71000    Frank          IT

In [22]:
# Exercice 15 - colonne niveau
employes.loc[employes['annees_exp'] >= 10, 'niveau'] = 'Senior'
employes.loc[employes['annees_exp'] < 10, 'niveau'] = 'Junior' 
employes

          nom departement  age  salaire  annees_exp  niveau
E001    Alice          IT   28    55000           3  Junior
E002      Bob          RH   35    52000           8  Junior
E003  Charlie          IT   42    77000          15  Senior
E004    Diana     Finance   31    58000           6  Junior
E005      Eve          RH   26    41000           2  Junior
E006    Frank          IT   38    71000          12  Senior

In [23]:
# Exercice 16 - condition multiple (plus de 30 ans) gagne plus de 5000â‚¬ (Sont dans le dÃ©partement IT ou Finance)
employes.loc[
    (employes['age'] > 30) &
    (employes['salaire'] > 5000) &
    (employes['departement'].isin(['IT', 'Finance']))
]

          nom departement  age  salaire  annees_exp  niveau
E003  Charlie          IT   42    77000          15  Senior
E004    Diana     Finance   31    58000           6  Junior
E006    Frank          IT   38    71000          12  Senior

In [28]:
# Exercice 17 - Afficher RH et augmenter  le salaire

#afficher les noms
print(employes.loc[employes['departement'] == 'RH', 'nom'])

# Augmenter de 10%
employes.loc[employes['departement'] == 'RH', 'salaire'] *= 1.10
employes

E002    Bob
E005    Eve
Name: nom, dtype: object

          nom departement  age  salaire  annees_exp  niveau
E001    Alice          IT   28  55000.0           3  Junior
E002      Bob          RH   35  69212.0           8  Junior
E003  Charlie          IT   42  77000.0          15  Senior
E004    Diana     Finance   31  58000.0           6  Junior
E005      Eve          RH   26  54571.0           2  Junior
E006    Frank          IT   38  71000.0          12  Senior

In [29]:
# Exercice 18 - une ligne sur deux, colonnes paire
employes.iloc[1::2, ::2]

        nom  age  annees_exp
E002    Bob   35           8
E004  Diana   31           6
E006  Frank   38          12